{
  "_name_or_path": "genomic_plip_hug/",
  "architectures": [
    "GenomicPLIPModel"
  ],
  "genomic_config": {
    "fc_layer_input": 4,
    "fc_layer_output": 512
  },
  "initializer_factor": 1.0,
  "logit_scale_init_value": 2.6592,
  "model_type": "clip",
  "projection_dim": 512,
  "text_config": {
    "bos_token_id": 0,
    "dropout": 0.0,
    "eos_token_id": 2,
    "model_type": "clip_text_model"
  },
  "torch_dtype": "float32",
  "transformers_version": "4.32.1",
  "vision_config": {
    "dropout": 0.0,
    "model_type": "clip_vision_model"
  }
}
